import datetime
from typing import List
from Solution import Solution


def run_test(list_numbers: List[int]):
    print(">>>>Start: " + datetime.datetime.now().strftime("%d.%m.%Y %H:%M:%S"))
    if len(list_numbers) > 100:
        print("Test array [length=" + str(len(list_numbers)) + "]")
    else:
        s: str = ""
        for i in range(0, len(list_numbers)):
            s += ("," if i > 0 else "") + str(list_numbers[i])
        print("Test array [" + s + "]")

    sol = Solution()
    res: int = sol.totalSteps(list_numbers)
    print("*****Result: " + str(res))
    print("<<<<End: " + datetime.datetime.now().strftime("%d.%m.%Y %H:%M:%S"))


def load_from_file(file_name: str) -> List[int]:
    try:
        file = open(file_name, "rt")
        s: str = file.read()
        str_list: List[str] = s.split(",")
        num_list: List[int] = []
        for i in range(0, len(str_list)):
            num_list.append(int(str_list[i]))

        return num_list
    except OSError:
        print("Невозможно открыть файл")
        return []

"""
[1,2,8,5,6] два шага
[1,2,8][5,6]
============================================
[1,2,8,6,5] один шаг
[1,2,8][6][5]
============================================
[1,2,8,6,5,10,9] один шаг
[1,2,8][6][5,10][9]

По шагам X
1.Там, где 1 элемент, то удалить сразу
[1,2,8][10]
============================================
[1,2,8,6,5,10,11,2,3,4] три шага
[1,2,8][6][5,10,11][2,3,4]

По шагам X
[1,2,8][10,11][3,4]
...
============================================
[1,2,8,6,5,4,4,10,11,12,100,110,120,1,2,3,4,5,4,3,2,1]
По шагам X
1.Разбить на понижении высоты 
[1,2,8][6][5][4,4,10,11,12,100,110,120][1,2,3,4,5][4][3][2][1]
2.Удалить первые элементы (из всех мест, кроме первого массива)
[1,2,8][4,10,11,12,100,110,120][2,3,4,5]
3.Взять последний элемент из предыдущего массива PREV_MAX, и перебором в следующем массиве найти число элементов до PREV_MAX <= CURR_MIN
8 -> [4,^10,11,12,100,110,120]
120 -> [2,3,4,5^]
4.Максимальное число шагов в массивах - это число оставшихся шагов (четыре, а результат 5. Но шаг 2 можно пропустить, тогда сразу будет 5)

============================================
[1,2,80,6,5,10,11,12,12,14,1,2,3,2,1]
[1,2,80][6][5][10,11,12,12,14][1,2,3][2][1]
По шагам:
[1,2,80,6,5,10,11,12,12,14,1,2,3,2,1]
1.[1,2,80,10,11,12,12,14,2,3]
2.[1,2,80,11,12,12,14,3]
3.[1,2,80,12,12,14]
4.[1,2,80,12,14]
5.[1,2,80,14]
6.[1,2,80]
============================================
По шагам:
1.[1,2,8,4,10,11,12,100,110,120,2,3,4,5]
2.[1,2,8,10,11,12,100,110,120,3,4,5]
3.[1,2,8,10,11,12,100,110,120,4,5]
4.[1,2,8,10,11,12,100,110,120,5]
5.[1,2,8,10,11,12,100,110,120]
============================================
[5,3,4,4,7,3,6,11,8,5,11]
[5][3,4,4,7][3,6,11][8][5,11]

============================================
[5, 3, 4, 4, 7, 3, 6, 11, 8, 5, 11]
[5][3,4,4,7][3,6,11][8][5,11]
По шагам:
1.[5, 4, 4, 7, 6, 11, 11]
2.[5, 4, 7, 11, 11]
3.[5, 7, 11, 11]
"""

# test0: List[int] = [1, 2, 8, 5, 6] # 2
# run_test(test0)
# test1: List[int] = [1, 2, 4, 3]  # 1
# run_test(test1)
# test2: List[int] = [4, 5, 7, 7, 13]  # 0
# run_test(test2)
# test3: List[int] = [5, 3, 4, 4, 7, 3, 6, 11, 8, 5, 11]  # 3
# run_test(test3)
# test4: List[int] = [1,2,8,6,5,4,4,10,11,12,100,110,120,1,2,3,4,5,4,3,2,1] # 5
# run_test(test4)
# test5: List[int] = [1,2,80,6,5,10,11,12,12,14,1,2,3,2,1] # 6
# run_test(test5)
# test79 = load_from_file("resources/test_case79.txt")  # 17599
# run_test(test79)
test7 = load_from_file("resources/test_case84.txt")  # 99999
run_test(test7)


